In [1]:
import sqlite3
from prettytable import from_db_cursor


con = sqlite3.connect('./database/example.db')
cur = con.cursor()

# 테이블이 이미 있다면 삭제
cur.execute("DROP TABLE IF EXISTS score")

cur.execute("""
            CREATE TABLE score(
                name text,
                korean INTEGER,
                english INTEGER,
                math INTEGER
            )
            """)

In [6]:
def data_generator():
    datas = [
        ['Amy', 100, 100, 100],
        ['Bob', 80, 90, 70],
        ['Olivia', 60, 80, 90],
        ['Olaf', None, 30, None]
    ]
    for data in datas:
        yield data

cur.executemany("INSERT INTO score VALUES (?, ?, ?, ?)", data_generator())
cur.execute("SELECT * FROM score")
from_db_cursor(cur)

+--------+--------+---------+------+
|  name  | korean | english | math |
+--------+--------+---------+------+
|  Amy   |  100   |   100   | 100  |
|  Bob   |   80   |    90   |  70  |
| Olivia |   60   |    80   |  90  |
|  Olaf  |  None  |    30   | None |
+--------+--------+---------+------+

## COUNT
데이터의 개수를 확인하고 싶을 때 사용합니다.  
**NULL인 데이터를 제외하고 셉니다**  
`SELECT COUNT(컬럼) FROM 테이블`

In [8]:
# 국어 점수 중 NULL인 값을 제외하고 COUNT
cur.execute(
            """
            SELECT COUNT(korean)
            FROM score
            """
            )

from_db_cursor(cur)

+---------------+
| COUNT(korean) |
+---------------+
|       3       |
+---------------+

In [10]:
# 영어 점수는 NULL인 값이 없어서 전체 레코드 수와 일치
cur.execute(
            """
            SELECT COUNT(english)
            FROM score
            """
            )

from_db_cursor(cur)

+----------------+
| COUNT(english) |
+----------------+
|       4        |
+----------------+

In [11]:
# 특정 컬럼이 아닌 전체 레코드 수를 세고 싶은 경우 * 사용
cur.execute(
            """
            SELECT COUNT(*)
            FROM score
            """
            )

from_db_cursor(cur)

+----------+
| COUNT(*) |
+----------+
|    4     |
+----------+

## SUM
지정한 컬럼의 합을 구하고 싶은 경우 사용합니다  
`SELECT SUM(컬럼) FROM 테이블`

In [12]:
cur.execute(
            """
            SELECT SUM(english)
            FROM score
            """
            )

from_db_cursor(cur)

+--------------+
| SUM(english) |
+--------------+
|     300      |
+--------------+

In [13]:
cur.execute(
            """
            SELECT SUM(korean)
            FROM score
            """
            )

from_db_cursor(cur)

+-------------+
| SUM(korean) |
+-------------+
|     240     |
+-------------+

## AVG
지정한 컬럼의 평균을 구하고 싶은 경우 사용합니다  
`SELECT AGV(컬럼) FROM 테이블`

In [14]:
cur.execute(
            """
            SELECT AVG(english)
            FROM score
            """
            )

from_db_cursor(cur)

+--------------+
| AVG(english) |
+--------------+
|     75.0     |
+--------------+

## MAX
지정한 컬럼에서 최댓값을 구하고 싶은 경우 사용합니다.  
숫자형 뿐만 아니라 문자형에서도 사용 가능합니다  
`SELECT MAX(컬럼) FROM 테이블`

In [17]:
cur.execute(
            """
            SELECT MAX(english)
            FROM score
            """
            )

from_db_cursor(cur)

+--------------+
| MAX(english) |
+--------------+
|     100      |
+--------------+

In [18]:
# 문자형에서도 사용 가능
cur.execute(
            """
            SELECT MAX(name)
            FROM score
            """
            )

from_db_cursor(cur)

+-----------+
| MAX(name) |
+-----------+
|   Olivia  |
+-----------+

## MIN
지정한 컬럼에서 최솟값을 구하고 싶은 경우 사용합니다.  
숫자형 뿐만 아니라 문자형에서도 사용 가능합니다.  
`SELECT MIN(컬럼) FROM 테이블`

In [19]:
cur.execute(
            """
            SELECT MIN(english)
            FROM score
            """
            )

from_db_cursor(cur)

+--------------+
| MIN(english) |
+--------------+
|      30      |
+--------------+

In [20]:
# 문자형에서도 사용 가능
cur.execute(
            """
            SELECT MIN(name)
            FROM score
            """
            )

from_db_cursor(cur)

+-----------+
| MIN(name) |
+-----------+
|    Amy    |
+-----------+